# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

list = [1.1, 1.2, 3.1, 5, 10.01]
dif = 0
for i in range(0, len(list)):
    min = 0
    max = 0
    if list[i] < min:
        min = list[i]
    elif list
print(list)
print(sum)

